In [1]:
#Problem Statement 
# Dataset

In [2]:
#import libraries 
import pandas as pd

import numpy as np

In [3]:
# Read dataset 
df=pd.read_csv("Salary_Data.csv")

In [5]:
df.tail()

    YearsExperience    Salary
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [6]:
df.shape

(30, 2)

In [7]:
# split data into nput X and output y 
x=df.drop('Salary',axis=1).values
y=df['Salary'].values 
# x (input) should  be in 2 dimension

In [8]:
df.corr()

                 YearsExperience    Salary
YearsExperience         1.000000  0.978242
Salary                  0.978242  1.000000

In [9]:
# Linear Regressor 

from sklearn.linear_model import LinearRegression

In [10]:
# create object 

model = LinearRegression()

In [11]:
# Train model 
model.fit(x,y)

LinearRegression()

In [14]:
# Test  model 
y_pred = model.predict(x)

In [15]:
from sklearn.metrics import mean_squared_error,r2_score
print(mean_squared_error(y_pred,y,squared=False))
print(r2_score(y_pred,y))

5592.043608760662
0.9550206007551909

In [16]:
#Conclution 
print(model.coef_)

[9449.96232146]

In [ ]:
# a 1 unit increase in Experience  is associated with an increase of 9449.96232146 Salary.